---
sidebar_position: 2
title: ⌨️ Commandy
description: Příkazy používané v CISCO CLI 
---

# Commandy

## Základy
* Commandy jdou napsat zkráceně například místo `enable` stačí napsat `en`

## Nápověda
* Nápověda se zobrazí pomocí `?`

### Zobrazí se všechny možné příkazy
```
Router(config)# ?
Configure commands:
  aaa                Authentication, Authorization and Accounting.
  access-list        Add an access list entry
  banner             Define a login banner
  bba-group          Configure BBA Group
  boot               Modify system boot parameters
--more--
```

### Zobrazí vám jak může příkaz pokračovat
```
Router(config)# int ?
  Dialer            Dialer interface
  Dot11Radio        Dot11 interface
  Ethernet          IEEE 802.3
  FastEthernet      FastEthernet IEEE 802.3
  GigabitEthernet   GigabitEthernet IEEE 802.3z
  Loopback          Loopback interface
  Port-channel      Ethernet Channel of interfaces
  Serial            Serial
  Tunnel            Tunnel interface
  Virtual-Template  Virtual Template interface
  Vlan              Catalyst Vlans
  range             interface range command 
```

### Zobrazí zbytek příkazu
```
Router(config)# int?
interface
```
- nabídne příkazy začínající na int 

:::tip
* pro zobrazení další strany `space`, pro zobrazení dalšího řádku `enter`
* Průběh každého příkazu lze ukončit zkratkou `ctrl`+`shift`+`6`
* Pro doplnění příkazu slouží `tab`
:::

### Privilegovaný režim
Do privilegovaného režimu se dostaneš pomocí `enable`

```
Router>
Router> enable
Router#
```

### Konfigurace (Config)

## Globální konfigurace 
```
Router# configure terminal
Router(config)#
```

:::tip Stačí napsat `conf` a dvakrat enter
:::

## Konfigurace portů 
### Na routeru
Port na routeru např. *GigabitEthernet0/0/1* se nastavují pomocí
```
Router(config)#int GigabitEthernet0/0/1
Router(config-if)# 
```

:::tip Celý název lze zkrátit **`g0/0/0`**
```
Router(config)#int g0/0/0
Router(config-if)# 
```
:::

Více portů naráz jde nastavit pomocí rozsahu
```
Router(config)#int range g0/0/0 - g0/0/1
Router(config-if-range)#
```

:::tip jde zkrátit na poslední číslo druhého portu
```
Router(config)#int range g0/0/0 - 1
Router(config-if-range)#
```
:::


### Na switchi (virtualní porty)
```
Router(config)#int range vty 0 16
```

## Hostname
Pojďme přejmenovat router na R1
```
Router(config)#hostname R1
R1(config)#
```


## Banner
Zpráva která se objeví při otevření konzole
```
R1(config)#banner motd "vase zpráva"
```

## Zákaz DNS lookup
Při zadání špatnýho příkazu ho nebude hledat další příkaz (nemusíš mačkat `ctrl`+`shift`+`6`)
```
R1(config)#no ip domain lookup
```

## Hesla

### Šifrování hesel
```
R1(config)#service password-encryption
```

### Nastavení minimální délky hesla
Nastaví délku minimální délku hesla na 5 znaků
```
R1(config)#security passwords min-length
```

### Nastavení hesla pro privilegovaný režim
Nastaví heslo pro privilegovaný režim

```
R1(config)#enable `password/secret` "vaše heslo"
```

`password` nastaví nešifrované heslo (je uloženo v plain textu na disku)
`secret` nastaví šifrované heslo

:::warning Nastavení hesla pomocí `secret` má přednost před `password`
```
R1(config)#enable secret tvojemama
R1(config)#enable password mojemama
```

Heslo je `tvojemama`
:::

## Routing
Když máme více sítí a chceme aby router mohl posílat data do té druhé
```
Router(config)#ip route <adresa sítě> <maska> <ip adresa portu>
```


## Vzdálené připojení (SSH, Telnet)
# SSH 
6 kroků:
1. hostname
```
Router(config)#hostname R1
R1(config)#
```
2. domain name
```
R1(config)#ip domain-name <example.com> 
```
3. crypto key generate
:::warning
Klíč se generuje pomocí `domény` a `hostname`, tyto dvě věci musejí bejt před generováním
:::
```
R1(config)#crypto key generate rsa 
The name for the keys will be: R1.lol.cz
Choose the size of the key modulus in the range of 360 to 2048 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: <kliknem enter>
```
4. username
```
```
5. login local
```
```
6. transport input ssh